---
kind: other
id: Methods.T:Autodesk.Revit.DB.WallUtils
source: html/1e53c52b-2ad9-299e-f3f4-328c4ea4dae5.htm
---
# WallUtils Methods

Allows the wall's end to join to other walls. If that end is near other walls it will become joined as a result.